# -*- coding: gbk -


# (宫名+五行)，(卦名),(六亲),(地支+五行),(世应位置),(伏神 每宫首卦的六亲)+(伏神 每宫首卦的地支+五行)
Six_animal={
		'甲':'青龙','乙':'青龙','1':'青龙','2':'青龙',
		'丙':'朱雀','丁':'朱雀','3':'朱雀','4':'朱雀',
		'戊':'勾陈','己':'腾蛇','5':'勾陈','6':'腾蛇',
		'庚':'白虎','辛':'白虎','7':'白虎','8':'白虎',
		'壬':'玄武','癸':'玄武','9':'玄武','10':'玄武',
		}
Six_animal_list = ('青龙','朱雀','勾陈','腾蛇','白虎','玄武')

Six_Yao={
'111111':('乾金','乾为天',('子孙','妻财','父母','官鬼','兄弟','父母'),('子水','寅木','辰土','午火','申金','戌土'),(5,2),
	('子孙','妻财','父母','官鬼','兄弟','父母'),('子水','寅木','辰土','午火','申金','戌土')),
'011111':('乾金','天风姤',('父母','子孙','兄弟','官鬼','兄弟','父母'),('丑土','亥水','酉金','午火','申金','戌土'),(0,3),
	('子孙','妻财','父母','官鬼','兄弟','父母'),('子水','寅木','辰土','午火','申金','戌土')),
'001111':('乾金','天山遁',('父母','官鬼','兄弟','官鬼','兄弟','父母'),('辰土','午火','申金','午火','申金','戌土'),(1,4),
	('子孙','妻财','父母','官鬼','兄弟','父母'),('子水','寅木','辰土','午火','申金','戌土')),
'000111':('乾金','天地否',('父母','官鬼','妻财','官鬼','兄弟','父母'),('未土','巳火','卯木','午火','申金','戌土'),(2,5),
	('子孙','妻财','父母','官鬼','兄弟','父母'),('子水','寅木','辰土','午火','申金','戌土')),
'000011':('乾金','风地观',('父母','官鬼','妻财','父母','官鬼','妻财'),('未土','巳火','卯木','未土','巳火','卯木'),(3,0),
	('子孙','妻财','父母','官鬼','兄弟','父母'),('子水','寅木','辰土','午火','申金','戌土')),
'000001':('乾金','山地剥',('父母','官鬼','妻财','父母','子孙','妻财'),('未土','巳火','卯木','戌土','子水','寅木'),(4,1),
	('子孙','妻财','父母','官鬼','兄弟','父母'),('子水','寅木','辰土','午火','申金','戌土')),
'000101':('乾金','火地晋',('父母','官鬼','妻财','兄弟','父母','官鬼'),('未土','巳火','卯木','酉金','未土','巳火'),(3,0),
	('子孙','妻财','父母','官鬼','兄弟','父母'),('子水','寅木','辰土','午火','申金','戌土')),
'111101':('乾金','火天大有',('子孙','妻财','父母','兄弟','父母','官鬼'),('子水','寅木','辰土','酉金','未土','巳火'),(2,5),
	('子孙','妻财','父母','官鬼','兄弟','父母'),('子水','寅木','辰土','午火','申金','戌土')),
		
'110110':('兑金','兑为泽',('官鬼','妻财','父母','子孙','兄弟','父母'),('巳火','卯木','丑土','亥水','酉金','未土'),(5,2),
	('官鬼','妻财','父母','子孙','兄弟','父母'),('巳火','卯木','丑土','亥水','酉金','未土')),
'010110':('兑金','泽水困',('妻财','父母','官鬼','子孙','兄弟','父母'),('寅木','辰土','午火','亥水','酉金','未土'),(0,3),
	('官鬼','妻财','父母','子孙','兄弟','父母'),('巳火','卯木','丑土','亥水','酉金','未土')),
'000110':('兑金','泽地萃',('父母','官鬼','妻财','子孙','兄弟','父母'),('未土','巳火','卯木','亥水','酉金','未土'),(1,4),
	('官鬼','妻财','父母','子孙','兄弟','父母'),('巳火','卯木','丑土','亥水','酉金','未土')),
'001110':('兑金','泽山咸',('父母','官鬼','兄弟','子孙','兄弟','父母'),('辰土','午火','申金','亥水','酉金','未土'),(2,5),
	('官鬼','妻财','父母','子孙','兄弟','父母'),('巳火','卯木','丑土','亥水','酉金','未土')),
'001010':('兑金','水山蹇',('父母','官鬼','兄弟','兄弟','父母','子孙'),('辰土','午火','申金','申金','戌土','子水'),(3,0),
	('官鬼','妻财','父母','子孙','兄弟','父母'),('巳火','卯木','丑土','亥水','酉金','未土')),
'001000':('兑金','地山谦',('父母','官鬼','兄弟','父母','子孙','兄弟'),('辰土','午火','申金','丑土','亥水','酉金'),(4,1),
	('官鬼','妻财','父母','子孙','兄弟','父母'),('巳火','卯木','丑土','亥水','酉金','未土')),
'001100':('兑金','雷山小过',('父母','官鬼','兄弟','官鬼','兄弟','父母'),('辰土','午火','申金','午火','申金','戌土'),(3,0),
	('官鬼','妻财','父母','子孙','兄弟','父母'),('巳火','卯木','丑土','亥水','酉金','未土')),
'110100':('兑金','雷泽归妹',('官鬼','妻财','父母','官鬼','兄弟','父母'),('巳火','卯木','丑土','午火','申金','戌土'),(2,5),
	('官鬼','妻财','父母','子孙','兄弟','父母'),('巳火','卯木','丑土','亥水','酉金','未土')),

'101101':('离火','离为火',('父母','子孙','官鬼','妻财','子孙','兄弟'),('卯木','丑土','亥水','酉金','未土','巳火'),(5,2),
	('父母','子孙','官鬼','妻财','子孙','兄弟'),('卯木','丑土','亥水','酉金','未土','巳火')),
'001101':('离火','火山旅',('子孙','兄弟','妻财','妻财','子孙','兄弟'),('辰土','午火','申金','酉金','未土','巳火'),(0,3),
	('父母','子孙','官鬼','妻财','子孙','兄弟'),('卯木','丑土','亥水','酉金','未土','巳火')),
'011101':('离火','火风鼎',('子孙','官鬼','妻财','妻财','子孙','兄弟'),('丑土','亥水','酉金','酉金','未土','巳火'),(1,4),
	('父母','子孙','官鬼','妻财','子孙','兄弟'),('卯木','丑土','亥水','酉金','未土','巳火')),
'010101':('离火','火水未济',('父母','子孙','兄弟','妻财','子孙','兄弟'),('寅木','辰土','午火','酉金','未土','巳火'),(2,5),
	('父母','子孙','官鬼','妻财','子孙','兄弟'),('卯木','丑土','亥水','酉金','未土','巳火')),
'010001':('离火','山水蒙',('父母','子孙','兄弟','子孙','官鬼','父母'),('寅木','辰土','午火','戌土','子水','寅木'),(3,0),
	('父母','子孙','官鬼','妻财','子孙','兄弟'),('卯木','丑土','亥水','酉金','未土','巳火')),
'010011':('离火','风水涣',('父母','子孙','兄弟','子孙','兄弟','父母'),('寅木','辰土','午火','未土','巳火','卯木'),(4,1),
	('父母','子孙','官鬼','妻财','子孙','兄弟'),('卯木','丑土','亥水','酉金','未土','巳火')),
'010111':('离火','天水讼',('父母','子孙','兄弟','兄弟','妻财','子孙'),('寅木','辰土','午火','午火','申金','戌土'),(3,0),
	('父母','子孙','官鬼','妻财','子孙','兄弟'),('卯木','丑土','亥水','酉金','未土','巳火')),
'101111':('离火','天火同人',('父母','子孙','官鬼','兄弟','妻财','子孙'),('卯木','丑土','亥水','午火','申金','戌土'),(2,5),
	('父母','子孙','官鬼','妻财','子孙','兄弟'),('卯木','丑土','亥水','酉金','未土','巳火')),
		
'100100':('震木','震为雷',('父母','兄弟','妻财','子孙','官鬼','妻财'),('子水','寅木','辰土','午火','申金','戌土'),(5,2),
		('父母','兄弟','妻财','子孙','官鬼','妻财'),('子水','寅木','辰土','午火','申金','戌土')),
'000100':('震木','雷地豫',('妻财','子孙','兄弟','子孙','官鬼','妻财'),('未土','巳火','卯木','午火','申金','戌土'),(0,3),
		('父母','兄弟','妻财','子孙','官鬼','妻财'),('子水','寅木','辰土','午火','申金','戌土')),
'010100':('震木','雷水解',('兄弟','妻财','子孙','子孙','官鬼','妻财'),('寅木','辰土','午火','午火','申金','戌土'),(1,4),
		('父母','兄弟','妻财','子孙','官鬼','妻财'),('子水','寅木','辰土','午火','申金','戌土')),
'011100':('震木','雷风恒',('妻财','父母','官鬼','子孙','官鬼','妻财'),('丑土','亥水','酉金','午火','申金','戌土'),(2,5),
		('父母','兄弟','妻财','子孙','官鬼','妻财'),('子水','寅木','辰土','午火','申金','戌土')),
'011000':('震木','地风升',('妻财','父母','官鬼','妻财','父母','官鬼'),('丑土','亥水','酉金','丑土','亥水','酉金'),(3,0),
		('父母','兄弟','妻财','子孙','官鬼','妻财'),('子水','寅木','辰土','午火','申金','戌土')),
'011010':('震木','水风井',('妻财','父母','官鬼','官鬼','父母','妻财'),('丑土','亥水','酉金','申金','戌土','子水'),(4,1),
		('父母','兄弟','妻财','子孙','官鬼','妻财'),('子水','寅木','辰土','午火','申金','戌土')),
'011110':('震木','泽风大过',('妻财','父母','官鬼','父母','官鬼','妻财'),('丑土','亥水','酉金','亥水','酉金','未土'),(3,0),
		('父母','兄弟','妻财','子孙','官鬼','妻财'),('子水','寅木','辰土','午火','申金','戌土')),
'100110':('震木','泽雷随',('父母','兄弟','妻财','父母','官鬼','妻财'),('子水','寅木','辰土','亥水','酉金','未土'),(2,5),
		('父母','兄弟','妻财','子孙','官鬼','妻财'),('子水','寅木','辰土','午火','申金','戌土')),

'011011':('巽木','巽为风',('妻财','父母','官鬼','妻财','子孙','兄弟'),('丑土','亥水','酉金','未土','巳火','卯木'),(5,2),
		('妻财','父母','官鬼','妻财','子孙','兄弟'),('丑土','亥水','酉金','未土','巳火','卯木')),
'111011':('巽木','风天小畜',('父母','兄弟','妻财','妻财','子孙','兄弟'),('子水','寅木','辰土','未土','巳火','卯木'),(0,3),
		('妻财','父母','官鬼','妻财','子孙','兄弟'),('丑土','亥水','酉金','未土','巳火','卯木')),
'101011':('巽木','风火家人',('兄弟','妻财','父母','妻财','子孙','兄弟'),('卯木','丑土','亥水','未土','巳火','卯木'),(1,4),
		('妻财','父母','官鬼','妻财','子孙','兄弟'),('丑土','亥水','酉金','未土','巳火','卯木')),
'100011':('巽木','风雷益',('父母','兄弟','妻财','妻财','子孙','兄弟'),('子水','寅木','辰土','未土','巳火','卯木'),(2,5),
		('妻财','父母','官鬼','妻财','子孙','兄弟'),('丑土','亥水','酉金','未土','巳火','卯木')),
'100111':('巽木','天雷无妄',('父母','兄弟','妻财','子孙','官鬼','妻财'),('子水','寅木','辰土','午火','申金','戌土'),(3,0),
		('妻财','父母','官鬼','妻财','子孙','兄弟'),('丑土','亥水','酉金','未土','巳火','卯木')),
'100101':('巽木','火雷',('父母','兄弟','妻财','官鬼','妻财','子孙'),('子水','寅木','辰土','酉金','未土','巳火'),(4,1),
		('妻财','父母','官鬼','妻财','子孙','兄弟'),('丑土','亥水','酉金','未土','巳火','卯木')),
'100001':('巽木','山雷颐',('父母','兄弟','妻财','妻财','父母','兄弟'),('子水','寅木','辰土','戌土','子水','寅木'),(3,0),
		('妻财','父母','官鬼','妻财','子孙','兄弟'),('丑土','亥水','酉金','未土','巳火','卯木')),
'011001':('巽木','山风',('妻财','父母','官鬼','妻财','父母','兄弟'),('丑土','亥水','酉金','戌土','子水','寅木'),(2,5),
		('妻财','父母','官鬼','妻财','子孙','兄弟'),('丑土','亥水','酉金','未土','巳火','卯木')),

'010010':('坎水','坎为水',('子孙','官鬼','妻财','父母','官鬼','兄弟'),('寅木','辰土','午火','申金','戌土','子水'),(5,2),
		('子孙','官鬼','妻财','父母','官鬼','兄弟'),('寅木','辰土','午火','申金','戌土','子水')),
'110010':('坎水','水泽节',('妻财','子孙','官鬼','父母','官鬼','兄弟'),('巳火','卯木','丑土','申金','戌土','子水'),(0,3),
		('子孙','官鬼','妻财','父母','官鬼','兄弟'),('寅木','辰土','午火','申金','戌土','子水')),
'100010':('坎水','水雷屯',('兄弟','子孙','官鬼','父母','官鬼','兄弟'),('子水','寅木','辰土','申金','戌土','子水'),(1,4),
		('子孙','官鬼','妻财','父母','官鬼','兄弟'),('寅木','辰土','午火','申金','戌土','子水')),
'101010':('坎水','水火既济',('子孙','官鬼','兄弟','父母','官鬼','兄弟'),('卯木','丑土','亥水','申金','戌土','子水'),(2,5),
		('子孙','官鬼','妻财','父母','官鬼','兄弟'),('寅木','辰土','午火','申金','戌土','子水')),
'101110':('坎水','泽火革',('子孙','官鬼','兄弟','兄弟','父母','官鬼'),('卯木','丑土','亥水','亥水','酉金','未土'),(3,0),
		('子孙','官鬼','妻财','父母','官鬼','兄弟'),('寅木','辰土','午火','申金','戌土','子水')),
'101100':('坎水','雷火丰',('子孙','官鬼','兄弟','妻财','父母','官鬼'),('卯木','丑土','亥水','午火','申金','戌土'),(4,1),
		('子孙','官鬼','妻财','父母','官鬼','兄弟'),('寅木','辰土','午火','申金','戌土','子水')),
'101000':('坎水','地火明夷',('子孙','官鬼','兄弟','官鬼','兄弟','父母'),('卯木','丑土','亥水','丑土','亥水','酉金'),(3,0),
		('子孙','官鬼','妻财','父母','官鬼','兄弟'),('寅木','辰土','午火','申金','戌土','子水')),
'010000':('坎水','地水师',('子孙','官鬼','妻财','官鬼','兄弟','父母'),('寅木','辰土','午火','丑土','亥水','酉金'),(2,5),
		('子孙','官鬼','妻财','父母','官鬼','兄弟'),('寅木','辰土','午火','申金','戌土','子水')),

'001001':('艮土','艮为山',('兄弟','父母','子孙','兄弟','妻财','官鬼'),('辰土','午火','申金','戌土','子水','寅木'),(5,2),
		('兄弟','父母','子孙','兄弟','妻财','官鬼'),('辰土','午火','申金','戌土','子水','寅木')),
'101001':('艮土','山火贲',('官鬼','兄弟','妻财','兄弟','妻财','官鬼'),('卯木','丑土','亥水','戌土','子水','寅木'),(0,3),
		('兄弟','父母','子孙','兄弟','妻财','官鬼'),('辰土','午火','申金','戌土','子水','寅木')),
'111001':('艮土','山天大蓄',('妻财','官鬼','兄弟','兄弟','妻财','官鬼'),('子水','寅木','辰土','戌土','子水','寅木'),(1,4),
		('兄弟','父母','子孙','兄弟','妻财','官鬼'),('辰土','午火','申金','戌土','子水','寅木')),
'110001':('艮土','山泽损',('父母','官鬼','兄弟','兄弟','妻财','官鬼'),('巳火','卯木','丑土','戌土','子水','寅木'),(2,5),
		('兄弟','父母','子孙','兄弟','妻财','官鬼'),('辰土','午火','申金','戌土','子水','寅木')),
'110101':('艮土','火泽睽',('父母','官鬼','兄弟','子孙','兄弟','父母'),('巳火','卯木','丑土','酉金','未土','巳火'),(3,0),
		('兄弟','父母','子孙','兄弟','妻财','官鬼'),('辰土','午火','申金','戌土','子水','寅木')),
'110111':('艮土','天泽履',('父母','官鬼','兄弟','父母','子孙','兄弟'),('巳火','卯木','丑土','午火','申金','戌土'),(4,1),
		('兄弟','父母','子孙','兄弟','妻财','官鬼'),('辰土','午火','申金','戌土','子水','寅木')),
'110011':('艮土','风泽中孚',('父母','官鬼','兄弟','兄弟','父母','官鬼'),('巳火','卯木','丑土','未土','巳火','卯木'),(3,0),
		('兄弟','父母','子孙','兄弟','妻财','官鬼'),('辰土','午火','申金','戌土','子水','寅木')),
'001011':('艮土','风山渐',('兄弟','父母','子孙','兄弟','父母','官鬼'),('丑土','午火','申金','未土','巳火','卯木'),(2,5),
		('兄弟','父母','子孙','兄弟','妻财','官鬼'),('辰土','午火','申金','戌土','子水','寅木')),

'000000':('坤土','坤为地',('兄弟','父母','官鬼','兄弟','妻财','子孙'),('未土','巳火','卯木','丑土','亥水','酉金'),(5,2),
		('兄弟','父母','官鬼','兄弟','妻财','子孙'),('未土','巳火','卯木','丑土','亥水','酉金')),
'100000':('坤土','地雷复',('妻财','官鬼','兄弟','兄弟','妻财','子孙'),('子水','寅木','辰土','丑土','亥水','酉金'),(0,3),
		('兄弟','父母','官鬼','兄弟','妻财','子孙'),('未土','巳火','卯木','丑土','亥水','酉金')),
'110000':('坤土','地泽临',('父母','官鬼','兄弟','兄弟','妻财','子孙'),('巳火','卯木','丑土','丑土','亥水','酉金'),(1,4),
		('兄弟','父母','官鬼','兄弟','妻财','子孙'),('未土','巳火','卯木','丑土','亥水','酉金')),
'111000':('坤土','地天泰',('妻财','官鬼','兄弟','兄弟','妻财','子孙'),('子水','寅木','辰土','丑土','亥水','酉金'),(2,5),
		('兄弟','父母','官鬼','兄弟','妻财','子孙'),('未土','巳火','卯木','丑土','亥水','酉金')),
'111100':('坤土','雷天大壮',('妻财','官鬼','兄弟','父母','子孙','兄弟'),('子水','寅木','辰土','午火','申金','戌土'),(3,0),
		('兄弟','父母','官鬼','兄弟','妻财','子孙'),('未土','巳火','卯木','丑土','亥水','酉金')),
'111110':('坤土','泽天',('妻财','官鬼','兄弟','妻财','子孙','兄弟'),('子水','寅木','辰土','亥水','酉金','未土'),(4,1),
		('兄弟','父母','官鬼','兄弟','妻财','子孙'),('未土','巳火','卯木','丑土','亥水','酉金')),
'111010':('坤土','水天需',('妻财','官鬼','兄弟','子孙','兄弟','妻财'),('子水','寅木','辰土','申金','戌土','子水'),(3,0),
		('兄弟','父母','官鬼','兄弟','妻财','子孙'),('未土','巳火','卯木','丑土','亥水','酉金')),
'000010':('坤土','水地比',('兄弟','父母','官鬼','子孙','兄弟','妻财'),('未土','巳火','卯木','申金','戌土','子水'),(2,5),
		('兄弟','父母','官鬼','兄弟','妻财','子孙'),('未土','巳火','卯木','丑土','亥水','酉金')),

}

Zuhe_liuqin = {
		'金金':'兄弟','金木':'妻财','金水':'子孙','金土':'父母','金火':'官鬼',
		'木木':'兄弟','木土':'妻财','木火':'子孙','木水':'父母','木金':'官鬼',
		'水水':'兄弟','水火':'妻财','水木':'子孙','水金':'父母','水土':'官鬼',
		'火火':'兄弟','火金':'妻财','火土':'子孙','火木':'父母','火水':'官鬼',
		'土土':'兄弟','土水':'妻财','土金':'子孙','土火':'父母','土木':'官鬼',
		}


Energy_wuxing = {
'金木':0,'金水':2,'金火':1,'金土':1,
'火金':0,'火土':2,'火水':1,'火木':1,
'木土':0,'木火':2,'木金':1,'木水':1,
'水火':0,'水木':2,'水土':1,'水金':1,
'土水':0,'土金':2,'土木':1,'土火':1,
'水水':3,'金金':3,'木木':3,'土土':3,'火火':3,	
		}


input_gua = input("plz input the gua:\n")

#print(Six_Yao[str(input_gua)])


#input_date = input("plz input the date:\n")
input_date  =1 

Animal_list = list(
		Six_animal_list[Six_animal_list.index(Six_animal[str(input_date)],):] + Six_animal_list[:Six_animal_list.index(Six_animal[str(input_date)],)]
)

#print(Animal_list)

bian_gua = input("plz input the bian gua:\n")


liu_animal_list = list(
		Six_animal_list[Six_animal_list.index(Six_animal[str(input_date)],):] + Six_animal_list[:Six_animal_list.index(Six_animal[str(input_date)],)]
)
liu_animal_list = liu_animal_list[::-1]

# =========   首宫 伏神
shou_gong_liuqin = Six_Yao[str(input_gua)][5]
shou_gong_liuqin = shou_gong_liuqin[::-1]
shou_gong_dizhi_wuxing = Six_Yao[str(input_gua)][6]
shou_gong_dizhi_wuxing = shou_gong_dizhi_wuxing[::-1]

# ==========  本卦
ben_gua_liuqin = Six_Yao[str(input_gua)][2]
ben_gua_liuqin = ben_gua_liuqin[::-1]
ben_gua_dizhi_wuxing = Six_Yao[str(input_gua)][3]
ben_gua_dizhi_wuxing = ben_gua_dizhi_wuxing[::-1]

# ==========  变卦

if Six_Yao[str(input_gua)][0].find('金') == True:
	Gong_wuxing ='金'
elif Six_Yao[str(input_gua)][0].find('木') == True:
	Gong_wuxing ='木'
elif Six_Yao[str(input_gua)][0].find('水') == True:
	Gong_wuxing ='水'
elif Six_Yao[str(input_gua)][0].find('火') == True:
	Gong_wuxing ='火'
elif Six_Yao[str(input_gua)][0].find('土') == True:
	Gong_wuxing ='土'

bian_gua_dizhi_wuxing_tmp = []
bian_gua_liuqin=[]

shou_gong_dizhi_energy = []
shou_gong_dizhi_wuxing_tmp = []
ben_gua_dizhi_energy = []
ben_gua_dizhi_wuxing_tmp = []
bian_gua_dizhi_energy = []
bian_gua_dizhi_wuxing_tmp=[]

for i in range(0,6):
	if shou_gong_dizhi_wuxing[i].find('金') == True:
		shou_gong_dizhi_wuxing_tmp.append('金')
	elif shou_gong_dizhi_wuxing[i].find('木') == True:
		shou_gong_dizhi_wuxing_tmp.append('木')
	elif shou_gong_dizhi_wuxing[i].find('水') == True:
		shou_gong_dizhi_wuxing_tmp.append('水')
	elif shou_gong_dizhi_wuxing[i].find('火') == True:
		shou_gong_dizhi_wuxing_tmp.append('火')
	elif shou_gong_dizhi_wuxing[i].find('土') == True:
		shou_gong_dizhi_wuxing_tmp.append('土')
for i in range(0,6):
	shou_gong_dizhi_energy.append(Energy_wuxing[Gong_wuxing+shou_gong_dizhi_wuxing_tmp[i]])

for i in range(0,6):
	if ben_gua_dizhi_wuxing[i].find('金') == True:
		ben_gua_dizhi_wuxing_tmp.append('金')
	elif ben_gua_dizhi_wuxing[i].find('木') == True:
		ben_gua_dizhi_wuxing_tmp.append('木')
	elif ben_gua_dizhi_wuxing[i].find('水') == True:
		ben_gua_dizhi_wuxing_tmp.append('水')
	elif ben_gua_dizhi_wuxing[i].find('火') == True:
		ben_gua_dizhi_wuxing_tmp.append('火')
	elif ben_gua_dizhi_wuxing[i].find('土') == True:
		ben_gua_dizhi_wuxing_tmp.append('土')

for i in range(0,6):
	ben_gua_dizhi_energy.append(Energy_wuxing[Gong_wuxing+ben_gua_dizhi_wuxing_tmp[i]])

if int(bian_gua) == 0:
	Flag_bian_gua = False
else:
	Flag_bian_gua = True
	#bian_gua_liuqin = Six_Yao[str(bian_gua)][2]
	#bian_gua_liuqin = bian_gua_liuqin[::-1]
	bian_gua_dizhi_wuxing = Six_Yao[str(bian_gua)][3]
	bian_gua_dizhi_wuxing = bian_gua_dizhi_wuxing[::-1]

	for tmp in range(0,6):
		if bian_gua_dizhi_wuxing[tmp].find('金') == True:
			bian_gua_dizhi_wuxing_tmp.append('金')
		elif bian_gua_dizhi_wuxing[tmp].find('木') == True:
			bian_gua_dizhi_wuxing_tmp.append('木')
		elif bian_gua_dizhi_wuxing[tmp].find('水') == True:
			bian_gua_dizhi_wuxing_tmp.append('水')
		elif bian_gua_dizhi_wuxing[tmp].find('火') == True:
			bian_gua_dizhi_wuxing_tmp.append('火')
		elif bian_gua_dizhi_wuxing[tmp].find('土') == True:
			bian_gua_dizhi_wuxing_tmp.append('土')


	for tmp in range(0,6):
		bian_gua_liuqin.append(Zuhe_liuqin[Gong_wuxing+bian_gua_dizhi_wuxing_tmp[tmp]])
		bian_gua_dizhi_energy.append(Energy_wuxing[Gong_wuxing+bian_gua_dizhi_wuxing_tmp[tmp]])


print("六神",'\t',Six_Yao[str(input_gua)][0],'\t\t',Six_Yao[str(input_gua)][1],'\t\t','变卦' )
print('---------------------------------------------------------------')
print()

shi_yao = 5 - Six_Yao[str(input_gua)][4][0]
ying_yao = 5 - Six_Yao[str(input_gua)][4][1]


if Flag_bian_gua == True:
	for i in range(0,6):
		if i == 3:
			print('---------------------------------------------------------------')

		if  i== shi_yao:
			print(liu_animal_list[i],'\t',shou_gong_liuqin[i],shou_gong_dizhi_wuxing[i],'\t',ben_gua_liuqin[i],ben_gua_dizhi_wuxing[i],"=>世",
			'\t',bian_gua_liuqin[i],bian_gua_dizhi_wuxing[i])
		elif i == ying_yao:
			print(liu_animal_list[i],'\t',shou_gong_liuqin[i],shou_gong_dizhi_wuxing[i],'\t',ben_gua_liuqin[i],ben_gua_dizhi_wuxing[i],"=>应",
			'\t',bian_gua_liuqin[i],bian_gua_dizhi_wuxing[i])
		else:	
			print(liu_animal_list[i],'\t',shou_gong_liuqin[i],shou_gong_dizhi_wuxing[i],'\t',ben_gua_liuqin[i],ben_gua_dizhi_wuxing[i],
			'\t\t',bian_gua_liuqin[i],bian_gua_dizhi_wuxing[i])
else:
	for i in range(0,6):
		if i == 3:
			print('---------------------------------------------------------------')

		if  i== shi_yao:
			print(liu_animal_list[i],'\t',shou_gong_liuqin[i],shou_gong_dizhi_wuxing[i],'\t',ben_gua_liuqin[i],ben_gua_dizhi_wuxing[i],"=>世")
		elif i == ying_yao:
			print(liu_animal_list[i],'\t',shou_gong_liuqin[i],shou_gong_dizhi_wuxing[i],'\t',ben_gua_liuqin[i],ben_gua_dizhi_wuxing[i],"=>应")
		else:	
			print(liu_animal_list[i],'\t',shou_gong_liuqin[i],shou_gong_dizhi_wuxing[i],'\t',ben_gua_liuqin[i],ben_gua_dizhi_wuxing[i])

#===========================			Energy 			========================
print()
print('====================	Energy		===========================')

if Flag_bian_gua == True:
	for i in range(0,6):
		if i == 3:
			print('---------------------------------------------------------------')

		if  i== shi_yao:
			print(liu_animal_list[i],'\t',shou_gong_dizhi_wuxing[i],shou_gong_dizhi_energy[i],'\t',ben_gua_dizhi_wuxing[i],ben_gua_dizhi_energy[i],"=>世",
			'\t\t',bian_gua_dizhi_wuxing[i],bian_gua_dizhi_energy[i])
		elif i == ying_yao:
			print(liu_animal_list[i],'\t',shou_gong_dizhi_wuxing[i],shou_gong_dizhi_energy[i],'\t',ben_gua_dizhi_wuxing[i],ben_gua_dizhi_energy[i],"=>应",
			'\t\t',bian_gua_dizhi_wuxing[i],bian_gua_dizhi_energy[i])
		else:	
			print(liu_animal_list[i],'\t',shou_gong_dizhi_wuxing[i],shou_gong_dizhi_energy[i],'\t',ben_gua_dizhi_wuxing[i],ben_gua_dizhi_energy[i],
			'\t\t',bian_gua_dizhi_wuxing[i],bian_gua_dizhi_energy[i])
else:
	 
	for i in range(0,6):
		if i == 3:
			print('---------------------------------------------------------------')

		if  i== shi_yao:
			print(liu_animal_list[i],'\t',shou_gong_dizhi_wuxing[i],shou_gong_dizhi_energy[i],'\t',ben_gua_dizhi_wuxing[i],ben_gua_dizhi_energy[i],"=>世")
		elif i == ying_yao:
			print(liu_animal_list[i],'\t',shou_gong_dizhi_wuxing[i],shou_gong_dizhi_energy[i],'\t',ben_gua_dizhi_wuxing[i],ben_gua_dizhi_energy[i],"=>应")
		else:	
			print(liu_animal_list[i],'\t',shou_gong_dizhi_wuxing[i],shou_gong_dizhi_energy[i],'\t',ben_gua_dizhi_wuxing[i],ben_gua_dizhi_energy[i])
