liuqin=(
['父母壬戌土','兄弟壬申金','官鬼壬午火','父母甲辰土','妻财甲寅木','子孙甲子水'],
['子孙癸酉金','妻财癸亥水','兄弟癸丑土','官鬼乙卯木','父母乙巳火','兄弟乙未土'],
['兄弟戊子水','官鬼戊戌土','父母戊申金','官鬼庚辰土','子孙庚寅木','兄弟庚子水'],
['父母丙寅木','官鬼丙子水','子孙丙戌土','兄弟戊午火','子孙戊辰土','父母戊寅木'],
['妻财戊子水','兄弟戊戌土','子孙戊申金','兄弟甲辰土','官鬼甲寅木','妻财甲子水'],
['子孙壬戌土','妻财壬申金','兄弟壬午火','兄弟戊午火','子孙戊辰土','父母戊寅木'],
['父母癸酉金','兄弟癸亥水','官鬼癸丑土','妻财戊午火','官鬼戊辰土','子孙戊寅木'],
['妻财戊子水','兄弟戊戌土','子孙戊申金','官鬼乙卯木','父母乙巳火','兄弟乙未土'],
['兄弟辛卯木','子孙辛巳火','妻财辛未土','妻财甲辰土','兄弟甲寅木','父母甲子水'],
['兄弟壬戌土','子孙壬申金','父母壬午火','兄弟丁丑土','官鬼丁卯木','父母丁巳火'],
['子孙癸酉金','妻财癸亥水','兄弟癸丑土','兄弟甲辰土','官鬼甲寅木','妻财甲子水'],
['父母壬戌土','兄弟壬申金','官鬼壬午火','妻财乙卯木','官鬼乙巳火','父母乙未土'],
['子孙壬戌土','妻财壬申金','兄弟壬午火','官鬼己亥水','子孙己丑土','父母己卯木'],
['官鬼己巳火','父母己未土','兄弟己酉金','父母甲辰土','妻财甲寅木','子孙甲子水'],
['兄弟癸酉金','子孙癸亥水','父母癸丑土','兄弟丙申金','官鬼丙午火','父母丙辰土'],
['妻财庚戌土','官鬼庚申金','子孙庚午火','兄弟乙卯木','子孙乙巳火','妻财乙未土'],
['妻财丁未土','官鬼丁酉金','父母丁亥水','妻财庚辰土','兄弟庚寅木','父母庚子水'],
['兄弟丙寅木','父母丙子水','妻财丙戌土','官鬼辛酉金','父母辛亥水','妻财辛丑土'],
['子孙癸酉金','妻财癸亥水','兄弟癸丑土','兄弟丁丑土','官鬼丁卯木','父母丁巳火'],
['妻财辛卯木','官鬼辛巳火','父母辛未土','妻财乙卯木','官鬼乙巳火','父母乙未土'],
['子孙己巳火','妻财己未土','官鬼己酉金','妻财庚辰土','兄弟庚寅木','父母庚子水'],
['官鬼丙寅木','妻财丙子水','兄弟丙戌土','妻财己亥水','兄弟己丑土','官鬼己卯木'],
['妻财丙寅木','子孙丙子水','父母丙戌土','妻财乙卯木','官鬼乙巳火','父母乙未土'],
['子孙癸酉金','妻财癸亥水','兄弟癸丑土','兄弟庚辰土','官鬼庚寅木','妻财庚子水'],
['妻财壬戌土','官鬼壬申金','子孙壬午火','妻财庚辰土','兄弟庚寅木','父母庚子水'],
['官鬼丙寅木','妻财丙子水','兄弟丙戌土','兄弟甲辰土','官鬼甲寅木','妻财甲子水'],
['兄弟丙寅木','父母丙子水','妻财丙戌土','妻财庚辰土','兄弟庚寅木','父母庚子水'],
['妻财丁未土','官鬼丁酉金','父母丁亥水','官鬼辛酉金','父母辛亥水','妻财辛丑土'],
['兄弟戊子水','官鬼戊戌土','父母戊申金','妻财戊午火','官鬼戊辰土','子孙戊寅木'],
['兄弟己巳火','子孙己未土','妻财己酉金','官鬼己亥水','子孙己丑土','父母己卯木'],
['父母丁未土','兄弟丁酉金','子孙丁亥水','兄弟丙申金','官鬼丙午火','父母丙辰土'],
['妻财庚戌土','官鬼庚申金','子孙庚午火','官鬼辛酉金','父母辛亥水','妻财辛丑土'],
['父母壬戌土','兄弟壬申金','官鬼壬午火','兄弟丙申金','官鬼丙午火','父母丙辰土'],
['兄弟庚戌土','子孙庚申金','父母庚午火','兄弟甲辰土','官鬼甲寅木','妻财甲子水'],
['官鬼己巳火','父母己未土','兄弟己酉金','妻财乙卯木','官鬼乙巳火','父母乙未土'],
['父母癸酉金','兄弟癸亥水','官鬼癸丑土','兄弟己亥水','官鬼己丑土','子孙己卯木'],
['兄弟辛卯木','子孙辛巳火','妻财辛未土','父母己亥水','妻财己丑土','兄弟己卯木'],
['父母己巳火','兄弟己未土','子孙己酉金','兄弟丁丑土','官鬼丁卯木','父母丁巳火'],
['子孙戊子水','父母戊戌土','兄弟戊申金','兄弟丙申金','官鬼丙午火','父母丙辰土'],
['妻财庚戌土','官鬼庚申金','子孙庚午火','子孙戊午火','妻财戊辰土','兄弟戊寅木'],
['官鬼丙寅木','妻财丙子水','兄弟丙戌土','兄弟丁丑土','官鬼丁卯木','父母丁巳火'],
['兄弟辛卯木','子孙辛巳火','妻财辛未土','妻财庚辰土','兄弟庚寅木','父母庚子水'],
['兄弟丁未土','子孙丁酉金','妻财丁亥水','兄弟甲辰土','官鬼甲寅木','妻财甲子水'],
['父母壬戌土','兄弟壬申金','官鬼壬午火','兄弟辛酉金','子孙辛亥水','父母辛丑土'],
['父母丁未土','兄弟丁酉金','子孙丁亥水','妻财乙卯木','官鬼乙巳火','父母乙未土'],
['官鬼癸酉金','父母癸亥水','妻财癸丑土','官鬼辛酉金','父母辛亥水','妻财辛丑土'],
['父母丁未土','兄弟丁酉金','子孙丁亥水','官鬼戊午火','父母戊辰土','妻财戊寅木'],
['父母戊子水','妻财戊戌土','官鬼戊申金','官鬼辛酉金','父母辛亥水','妻财辛丑土'],
['官鬼丁未土','父母丁酉金','兄弟丁亥水','兄弟己亥水','官鬼己丑土','子孙己卯木'],
['兄弟己巳火','子孙己未土','妻财己酉金','妻财辛酉金','官鬼辛亥水','子孙辛丑土'],
['妻财庚戌土','官鬼庚申金','子孙庚午火','妻财庚辰土','兄弟庚寅木','父母庚子水'],
['官鬼丙寅木','妻财丙子水','兄弟丙戌土','子孙丙申金','父母丙午火','兄弟丙辰土'],
['官鬼辛卯木','父母辛巳火','兄弟辛未土','子孙丙申金','父母丙午火','兄弟丙辰土'],
['父母庚戌土','兄弟庚申金','官鬼庚午火','父母丁丑土','妻财丁卯木','官鬼丁巳火'],
['官鬼庚戌土','父母庚申金','妻财庚午火','兄弟己亥水','官鬼己丑土','子孙己卯木'],
['兄弟己巳火','子孙己未土','妻财己酉金','妻财丙申金','兄弟丙午火','子孙丙辰土'],
['兄弟辛卯木','子孙辛巳火','妻财辛未土','官鬼辛酉金','父母辛亥水','妻财辛丑土'],
['父母丁未土','兄弟丁酉金','子孙丁亥水','父母丁丑土','妻财丁卯木','官鬼丁巳火'],
['父母辛卯木','兄弟辛巳火','子孙辛未土','兄弟戊午火','子孙戊辰土','父母戊寅木'],
['兄弟戊子水','官鬼戊戌土','父母戊申金','官鬼丁丑土','子孙丁卯木','妻财丁巳火'],
['官鬼辛卯木','父母辛巳火','兄弟辛未土','兄弟丁丑土','官鬼丁卯木','父母丁巳火'],
['父母庚戌土','兄弟庚申金','官鬼庚午火','兄弟丙申金','官鬼丙午火','父母丙辰土'],
['兄弟戊子水','官鬼戊戌土','父母戊申金','兄弟己亥水','官鬼己丑土','子孙己卯木'],
['兄弟己巳火','子孙己未土','妻财己酉金','兄弟戊午火','子孙戊辰土','父母戊寅木']
	)
shiyingGrp = (
    ['世', '', '', '应', '', ''], ['世', '', '', '应', '', ''], ['', '应', '', '', '世', ''], ['', '', '世', '', '', '应'], ['', '', '世', '', '', '应'], ['', '', '世', '', '', '应'], ['应', '', '', '世', '', ''], ['应', '', '', '世', '', ''],
    ['', '', '应', '', '', '世'], ['', '世', '', '', '应', ''], ['应', '', '', '世', '', ''], ['应', '', '', '世', '', ''], ['应', '', '', '世', '', ''], ['应', '', '', '世', '', ''], ['', '世', '', '', '应', ''], ['', '', '应', '', '', '世'],
    ['应', '', '', '世', '', ''], ['应', '', '', '世', '', ''], ['', '应', '', '', '世', ''], ['', '', '世', '', '', '应'], ['', '世', '', '', '应', ''], ['', '', '应', '', '', '世'], ['', '世', '', '', '应', ''], ['', '', '应', '', '', '世'],
    ['', '', '世', '', '', '应'], ['', '应', '', '', '世', ''], ['', '', '世', '', '', '应'], ['', '', '世', '', '', '应'], ['世', '', '', '应', '', ''], ['世', '', '', '应', '', ''], ['应', '', '', '世', '', ''], ['应', '', '', '世', '', ''],
    ['', '应', '', '', '世', ''], ['', '', '世', '', '', '应'], ['', '', '世', '', '', '应'], ['', '', '世', '', '', '应'], ['', '应', '', '', '世', ''], ['', '', '世', '', '', '应'], ['', '', '世', '', '', '应'], ['', '应', '', '', '世', ''],
    ['应', '', '', '世', '', ''], ['应', '', '', '世', '', ''], ['', '世', '', '', '应', ''], ['', '', '应', '', '', '世'], ['', '应', '', '', '世', ''], ['', '', '世', '', '', '应'], ['', '', '应', '', '', '世'], ['', '世', '', '', '应', ''],
    ['', '', '世', '', '', '应'], ['', '应', '', '', '世', ''], ['世', '', '', '应', '', ''], ['世', '', '', '应', '', ''], ['应', '', '', '世', '', ''], ['应', '', '', '世', '', ''], ['', '世', '', '', '应', ''], ['', '', '应', '', '', '世'],
    ['世', '', '', '应', '', ''], ['世', '', '', '应', '', ''], ['', '世', '', '', '应', ''], ['', '', '应', '', '', '世'], ['', '', '世', '', '', '应'], ['', '', '世', '', '', '应'], ['应', '', '', '世', '', ''], ['应', '', '', '世', '', '']
  )


#print(shi[0])
Gua_grp=[   
     [1, 1, 1, 1, 1, 1],
     [0, 0, 0, 0, 0, 0],
     [0, 1, 0, 0, 0, 1],  
     [1, 0, 0, 0, 1, 0], 
     [0, 1, 0, 1, 1, 1], 
     [1, 1, 1, 0, 1, 0], 
     [0, 0, 0, 0, 1, 0], 
     [0, 1, 0, 0, 0, 0],  

     [1, 1, 0, 1, 1, 1], 
     [1, 1, 1, 0, 1, 1], 
     [0, 0, 0, 1, 1, 1],  
     [1, 1, 1, 0, 0, 0], 
     [1, 1, 1, 1, 0, 1], 
     [1, 0, 1, 1, 1, 1], 
     [0, 0, 0, 1, 0, 0], 
     [0, 0, 1, 0, 0, 0], 

     [0, 1, 1, 0, 0, 1], 
     [1, 0, 0, 1, 1, 0], 
     [0, 0, 0, 0, 1, 1], 
     [1, 1, 0, 0, 0, 0], 
     [1, 0, 1, 0, 0, 1], 
     [1, 0, 0, 1, 0, 1], 
     [1, 0, 0, 0, 0, 0], 
     [0, 0, 0, 0, 0, 1], 

     [1, 1, 1, 0, 0, 1], 
     [1, 0, 0, 1, 1, 1], 
     [1, 0, 0, 0, 0, 1], 
     [0, 1, 1, 1, 1, 0], 
     [0, 1, 0, 0, 1, 0], 
     [1, 0, 1, 1, 0, 1], 
     [0, 1, 1, 1, 0, 0],  
     [0, 0, 1, 1, 1, 0],  

     [1, 1, 1, 1, 0, 0], 
     [0, 0, 1, 1, 1, 1], 
     [1, 0, 1, 0, 0, 0], 
     [0, 0, 0, 1, 0, 1], 
     [1, 1, 0, 1, 0, 1], 
     [1, 0, 1, 0, 1, 1], 
     [0, 1, 0, 1, 0, 0], 
     [0, 0, 1, 0, 1, 0], 

     [1, 0, 0, 0, 1, 1], 
     [1, 1, 0, 0, 0, 1], 
     [0, 1, 1, 1, 1, 1], 
     [1, 1, 1, 1, 1, 0], 
     [0, 1, 1, 0, 0, 0], 
     [0, 0, 0, 1, 1, 0], 
     [0, 1, 1, 0, 1, 0], 
     [0, 1, 0, 1, 1, 0], 

     [0, 1, 1, 1, 0, 1], 
     [1, 0, 1, 1, 1, 0], 
     [0, 0, 1, 0, 0, 1], 
     [1, 0, 0, 1, 0, 0], 
     [1, 1, 0, 1, 0, 0], 
     [0, 0, 1, 0, 1, 1], 
     [0, 0, 1, 1, 0, 1], 
     [1, 0, 1, 1, 0, 0], 

     [1, 1, 0, 1, 1, 0],
     [0, 1, 1, 0, 1, 1],
     [1, 1, 0, 0, 1, 0],
     [0, 1, 0, 0, 1, 1],
     [1, 1, 0, 0, 1, 1],
     [0, 0, 1, 1, 0, 0],
     [0, 1, 0, 1, 0, 1],
     [1, 0, 1, 0, 1, 0]]
  
   
#print(Gua_grp)
guashen_grp=[]
shi_grp=[]

#shi=["子","午","丑","未","寅","申","卯","酉","辰","戌","巳","亥"]
#shi=['子','午','丑','未','寅','申','卯','酉','辰','戌','巳','亥']
#print(shi[0])
def GetShiShen(chishi):
	#pass
	#print( chishi)
	#print(shi[2])
	if chishi =='子' or chishi=='午':
		shen='初爻'
	elif chishi =='丑' or chishi=='未':
		shen='二爻'
	elif chishi =='寅' or chishi=='申':
		shen='三爻'
	elif chishi =='卯' or chishi=='酉':
		shen='四爻'
	elif chishi =='辰' or chishi=='戌':
		shen='五爻'
	elif chishi =='巳' or chishi=='亥':
		shen='上爻'

	return shen

print(shiyingGrp[15])
print(liuqin[15][0][3])
print(GetShiShen(liuqin[15][0][3]))

for i in  range(64):
		#print(i)
		if shiyingGrp[i][0] == '世' :
			if (Gua_grp[i][0])==1:
				guashen='巳'
			else:
				guashen='亥'
			#guashen = guashen + '上爻'	
			#print(liuqin[i][0][3])
			shishen = GetShiShen(liuqin[i][0][3])
		elif shiyingGrp[i][1] == '世':
			if Gua_grp[i][1]==1:
				guashen='辰'
			else:
				guashen='戌'
			#guashen = guashen + '五爻'
			shishen=GetShiShen(liuqin[i][1][3])
		elif shiyingGrp[i][2] == '世':
			if Gua_grp[i][2]==1:
				guashen='卯'
			else:
				guashen='酉'
			#guashen = guashen + '四爻'
			shishen=GetShiShen(liuqin[i][2][3])
		elif shiyingGrp[i][3] == '世':
			if Gua_grp[i][3]==1:
				guashen='寅'
			else:
				guashen='申'
			#guashen = guashen + '三爻'
			shishen=GetShiShen(liuqin[i][3][3])
		elif shiyingGrp[i][4] == '世':
			if Gua_grp[i][4]==1:
				guashen='丑'
			else:
				guashen='未'
			#guashen = guashen + '二爻'
			shishen=GetShiShen(liuqin[i][4][3])
		elif shiyingGrp[i][5] == '世':
			if Gua_grp[i][5]==1:
				guashen='子'
			else:
				guashen='午'
			#guashen = guashen + '初爻'
			shishen=GetShiShen(liuqin[i][5][3])
		guashen_grp.append(guashen)
		shi_grp.append(shishen)

print(guashen_grp)
print(shi_grp)
Gua_Shi_grp=[]
#for i in range(64):
#	Gua_Shi_grp [i]= "".join(guashen_grp[i]) + ','+"".join(shi_grp[i])

print(Gua_Shi_grp)
with open("NaJia2.txt","w") as f:
	for i in range(64):
		if i==7 or i==15 or i==23 or i==31 or i==39 or i==47 or i==55 or i==63:
			f.write("['"+"".join(guashen_grp[i]) + "','"+ "".join(shi_grp[i])+"'],"+'\n')
		else:
			f.write("['"+"".join(guashen_grp[i]) + "','"+ "".join(shi_grp[i])+"'],")

