# -*- coding: gbk -*
#Yao_each=input('please input Yao:\n')

#print(Yao_each[:])

gua={'000':('坤','土'),'111':('乾','金'),'110':('兑','金'),'101':('离','火'),
     '011':('巽','木'),'010':('坎','水'),'100':('震','木'),'001':('艮','土'),
		}
for key ,value in gua.items():
	print(key,value)

Inside={'乾':('子水','寅木','辰土'),'兑':('巳火','卯木','丑土'),
	'离':('卯木','丑土','亥水'),'震':('子水','寅木','辰土'),
	'巽':('丑土','亥水','酉金'),'坎':('寅木','辰土','午火'),
	'艮':('辰土','午火','申金'),'坤':('未土','巳火','卯木'),
		}
Outside={'乾':('午火','申金','戌土'),'兑':('亥水','酉金','未土'),
	 '离':('酉金','未土','巳火'),'震':('午火','申金','戌土'),
	 '巽':('未土','巳火','卯木'),'坎':('申金','戌土','子水'),
	 '艮':('戌土','子水','寅木'),'坤':('丑土','亥水','酉金'),
		}



